<template>
  <van-popup v-model="showAgreement" round custom-style="height: 80%" closeable>
    <div class="agreementBox">
      <div>学霸卡入网服务协议</div>

      <div class="left_text">甲方：（个人签名）勾选同意视为完成签名</div>

      <div class="left_text">乙方：南京友众力信息技术有限公司</div>

      <div class="left_text">说明：</div>
      <div class="left_text">◆甲方应具有完全的民事行为能力。无民事行为能力或限制民事行为能力的甲方入网时应经过其监护人的同意并签名确认。</div>
      <div class="left_text">◆在勾选同意本协议前，请甲方或其代理人仔细阅读本协议各条款，如有疑问请及时咨询。</div>
      <div class="left_text">◆甲方所需的业务、办理手续以及资费标准请参见乙方的相关业务说明。</div>
      <div class="left_text">根据《中华人民共和国合同法》,《中华人民共和国电信条例》及其他有关法律、法规的规定，甲乙双方在平等、自愿、公平、诚实、信用的基础上，就学霸卡通信服务的有关事宜，达成协议如下：
      </div>

      <div class="left_text">一、服务内容和资费标准</div>
      <div class="left_text">1、乙方在现有技术条件下的网络覆盖范围内，为甲方有偿提供通信服务(暂不提供国际漫游服务)。</div>
      <div class="left_text">2、甲方可自主选择乙方提供的产品及套餐，套餐到期后如用户未修改则系统自动按照当前有效套餐规则顺延。
      </div>
      <div class="left_text">
        3、乙方根据甲方选择的产品包（包括但不限定于套餐及加油包等）向甲方收取相关费用，包括月租费、通信费、功能费等费用以及甲方选择的其他业务的费用。计费周期为固定时间月，即上月27日0点到本月26日23:59:59（由于网络设备产生话单及相关处理会有时延，可能发生每月部分话费计入下月话费中收取的情况）。本计费周期内购买的加油包和套餐（其中包括套餐中的语音用量、上网流量和用户购买的加油包用量）于本计费周期结束时全部清零（注：特殊说明的产品/套餐/计费周期除外）。
      </div>
      <div class="left_text">4、因为运营商平台等原因造成语音、流量等延时计费，超出套餐部分的费用，由甲方承担。</div>
      <div class="left_text">5、合约期到期后，如遇乙方统一调整通信费用标准，则按乙方统一规定执行。</div>
      <div class="left_text">二、乙方的义务</div>
      <div class="left_text">1、乙方为甲方提供的移动通信服务应当达到提供服务运营商的相关标准。</div>
      <div class="left_text">2、乙方通过微信公众号、网站或短信等方式向甲方公布并提示服务项目、服务时限、服务范围及资费标准等内容。</div>
      <div class="left_text">3、乙方向甲方提供微信号公众号进行业务办理、业务咨询和话费信息查询。</div>
      <div class="left_text">4、乙方有义务采取公布语音客服或在线客服等形式受理甲方投诉，并在接到投诉之日起15日内答复甲方。</div>
      <div class="left_text">5、若甲方对乙方收取的费用存有异议，乙方有责任进行调查、解释，并告知甲方核实处理的结果，乙方对移动电话原始话费数据及信息服务计费原始数据保留期限为3个月，对客户提出异议的话单，应保存至异议解决为止。</div>
      <div class="left_text">6、乙方不得侵害甲方的通信自由和通信秘密，对甲方的客户资料负有保密义务。但根据法律法规规定，乙方应配合公安机关、人民检察院、国家安全机关及依据法律法规有权进行调查的其他部门的工作要求。</div>
      <div class="left_text">
        7、在甲方欠费的情况下，如甲方在约定的期限内补齐费用并申请开机的，乙方在收到甲方费用时起24个小时内为甲方恢复移动通信服务。
      </div>
      <div class="left_text">8、此学霸卡为预付产品，即“先预存话费，后使用” 的缴费方式。乙方对使用的甲方应进行余额提示，通知方式包括但不限于微信、短信、电话或信函。甲方应保证账户上有充足的款项，如甲方有欠费，乙方有权限制或停止向甲方提供服务，且乙方可不再另行通知。</div>
      <div class="left_text">9、乙方检修线路、设备搬迁、工程割接、网络及软件升级等可预见的原因可能影响甲方使用的，应于国家规定的时限通知甲方，通知方式包括但不限于微信公众号、短信、媒体公告。</div>
      <div class="left_text">10、甲方向乙方申告移动电话通信障碍（指运营商相关交换设备或传输线路原因造成通信中断等现象，不包括网络覆盖、终端设备故障及运营商限制服务等），乙方应自接到申告之时尽快联系提供服务的运营商完成修复或者调通。
      </div>
      <div class="left_text">11、乙方应在承诺时限内为甲方开通其申请的服务(双方约定超出此时限的除外)，乙方未及时开通的，应减免甲方自申请之日至服务开通期间的该项服务相应的月功能费。</div>
      <div class="left_text">12、乙方有权根据国家政策、提供服务运营商的相关要求、乙方自身产品及服务更新等原因修改本协议相关条款内容。</div>
      <div class="left_text">三、甲方的义务</div>
      <div class="left_text">1、 根据运营商要求业务流程及办理要求， 甲方办理入网手续时，需提供真实有效的身份证件（二代身份证）。如甲方入网登记资料发生变更，应及时通知乙方，并应及时通过乙方提供的渠道办理资料变更业务。如运营商实名要求变更，系统将做相应流程调整。
      </div>
      <div class="left_text">2、甲方应按照与乙方约定的时间、方式，及时、足额地向乙方支付产品、套餐、服务等相关费用。过期未交的款项，自付费日期期满后次日起，甲方应按照每日未交款项的3‰（千分之三）向乙方支付违约金。
      </div>
      <div class="left_text">3、若甲方对乙方收取的费用存有异议，应在异议费用发生后三个月内向乙方提出(系统产生客户话单当月起后三个月，含当月)。</div>
      <div class="left_text">
        4、甲方要求终止提供服务时，应在结清所有当前已提供的服务费用后办理退网手续，由于网络设备产生数据处理会有时延，退网时可能会存在部分费用尚未入帐，甲方可在所有数据全部处理后办理余额的清退或补收手续。产品、套餐及服务中注明一次性收取的费用或其它特殊说明的费用不予清退。
      </div>
      <div class="left_text">四、特殊情况的责任承担</div>
      <div class="left_text">1、在下列情况下，乙方有权暂停或限制甲方的服务，由此给甲方造成的损失，乙方不承担责任：</div>
      <div class="left_text">（1）甲方预付费使用完毕而未及时补交款项（包括预付费账户余额不足以划扣下一笔预付费用）；</div>
      <div class="left_text">（2）甲方使用卡从事违法犯罪活动或损害社会公共利益的活动、发送违法信息或未经接收人同意大量发送骚扰信息、拨打骚扰电话等不当行为。</div>
      <div class="left_text">（3）甲方提供的证件或资料虚假不实；</div>
      <div class="left_text">（4）乙方收到国家有关部门、运营商通知要求停止向甲方提供通信服务；</div>
      <div class="left_text">2、 甲方逾期未交清费用，乙方有权拒绝甲方提出的其他业务申请，缴费及费用查询除外。</div>
      <div class="left_text">3、按照公平使用原则，乙方将按照甲方购买的产品、套餐、服务等规则进行限制，甲方使用服务超出所购买的产品、套餐、服务限制时，乙方可暂停甲方当时的相关服务，续费或再次购买相关服务后6小时内自动恢复开通。
      </div>
      <div class="left_text">4、在甲方欠费时，乙方有权按照国家相关规定暂停或限制提供给甲方的服务，并有权以信函、公告、委托第三方等形式追缴欠费。</div>
      <div class="left_text">
        5、甲方所办理的数据业务下行速率标称值仅为乙方提供的数据业务下行速率最高值，乙方不能保证在任何情况下均能达到标称值，甲方对此表示知悉并认可。
      </div>
      <div class="left_text">6、因甲方保管不善等原因导致其服务被他人非法使用，甲方应及时办理停用手续，并向公安部门报案。乙方应在技术上协助公安部门进行调查，但乙方不承担由此对甲方所造成的不良后果。</div>
      <div class="left_text">7、因甲方提供的客户资料不详、不实或变更后未通知乙方并办理客户资料变更手续等原因，使乙方无法将服务提供给甲方，乙方不承担由此对甲方所造成的不良后果。
      </div>
      <div class="left_text">8、因不可抗力（包括但不限于如地震、山洪、雷电及其他自然灾害、电磁干扰、战争暴乱、政府行为等）而使本协议部分或全部不能履行，双方互不承担违约责任。</div>
      <div class="left_text">9、 一方违约给对方造成损失的，应当依法承担赔偿责任，但任何一方应承担的赔偿损失的责任范围不包括对方未实现的预期利润或利益、商业信誉的损失、数据的丢失、第三方损失以及其他间接损失。</div>

      <div class="left_text">
        10、用乙方提供基于位置的服务时，乙方需要收集和处理甲方的位置信息、行踪轨迹。乙方会使用各种方式进行定位，包括但不限于通过IP地址、卫星信号以及能够提供相关信息的其他传感器（比如可能会为乙方提供附近设备、WLAN接入点和基站的信息）。甲方授权乙方、提供服务的通信运营商、其他卫星定位合作伙伴等基于上述服务收集、处理、提供乙方的位置、行踪轨迹等个人信息。乙方会对甲方位置信息进行定位计算和路径计算，帮助甲方获得更加精准的定位和路径服务。甲方可以通过关闭定位服务及相关权限停止乙方对甲方位置信息的收集，但甲方可能将无法获得相关服务或功能，或者无法达到相关服务拟达到的效果。
      </div>
      <div class="left_texe">
        11、乙方提供服务时，乙方需要收集和处理服务所需的甲方必要信息（如话单、微信OpenID、姓名、头像等），并授权乙方、提供服务的通信运营商、合作伙伴等收集、处理该信息。乙方、提供服务的通信运营商、合作伙伴等不得使用相关信息用于为甲方提供服务之外的用途。
      </div>
      <div class="left_texe">12、甲方同意并接受中国联通用户隐私政策：http://www.10010.com/net5/front/include/index_a/privacypolicy.html</div>
      <div class="left_text">五、协议的变更、转让与终止</div>
      <div class="left_text">1、 甲方办理各类业务所填写的表单、乙方以公告等书面形式公开做出的服务承诺均为本协议的补充协议，与本协议冲突部分以补充协议为准，补充协议中未约定部分以本协议为准。</div>
      <div class="left_text">2、甲乙双方约定，本协议服务内容、方式及资费等按照政府主管部门、提供服务通信运营商、乙方上级公司的规定，如在规定范围内须作变更，由甲方通过办理业务实现或由乙方进行公告，公告内容构成对本协议的变更，双方不再另行签订变更协议。
      </div>
      <div class="left_text">
        3、乙方承诺服务资费方案有效期为一年（双方特殊约定的除外）。乙方有权在有效期截止后修改资费方案。如需修改，乙方应在有效期届满前通知甲方，通知方式包括但不限于短信、线上营业厅、APP、微信公众号等公告。如无需修改，则原资费方案顺延一年，顺延次数不限。
      </div>

      <div class="left_text">4、 甲方将协议项下的权利义务转让给第三人（过户）后，由第三人与乙方重新签订服务协议, 本协议自动终止; 过户前发生的、但过户时尚未结算的费用，乙方将向新用户收取。因甲方私自转让而造成的欠费、停机等后果，由甲方自行承担。
      </div>
      <div class="left_text">5、因技术进步，乙方为提升服务质量对网络平台进行整体换代升级而导致服务无法继续履行，乙方应至少提前30日告知甲方，并提供合理的解决方案。</div>
      <div class="left_text">6、下列情况下乙方有权解除协议，终止提供服务。由此给甲方造成的损失，乙方不承担责任，并有权向甲方追讨欠费：</div>
      <div class="left_text">（1）甲方（包括代理人）提供的有效证件虚假不实；</div>
      <div class="left_text">（2）卡被用于违法犯罪活动或不当用途（有损乙方或相关第三方利益）；</div>
      <div class="left_text">（3）乙方收到国家有关部门、提供服务运营商通知要求停止为甲方提供服务；</div>
      <div class="left_text">（4）甲方欠费停机超过90天。</div>

      <div class="left_text">7、在法定终止条件或约定终止条件具备时，本协议终止。乙方继续保留向甲方追缴所欠费用的权利，并有权收回号码重新启用。</div>

      <div class="left_text">六、其他约定</div>

      <div class="left_text">1、本协议项下发生的争议，双方可协商解决，协商不成的，双方可向电信管理部门申诉或向消费者协会等有关部门投诉。双方通过协商不能解决争议的，则乙方同意在乙方所在地的仲裁机构、法院进行仲裁或诉讼解决。</div>

      <div class="left_text">2、本协议自业务受理之日起生效，有效期一年。本协议到期时，如甲乙双方均未提出对服务资费的修改要求，将继续执行本协议约定的资费。 （甲方承诺：本人已经充分、完整阅读并理解本协议所述全部条款及条件。如申请或使用乙方提供的业务，即视为您已阅读井同意受本协议的约束。）
      </div>

      <div class="left_text">甲方/甲方监护人/授权代理人 ：（签名）勾选同意视为完成签名</div>
      <div class="left_text">乙方：南京友众力信息技术有限公司</div>

      <div class="left_text">签署日期：（同勾选同意日期）</div>
    </div>
  </van-popup>
</template>
<script>
export default {
  data () {
    return {
      showAgreement: false
    }
  }
}
</script>

<style lang="less">
.agreementBox {
  font-size: 12px;
  padding: 15px;
  width: 6rem;
  height: 10rem;
  .left_text {
    padding: 5px 0;
  }
}
</style>
