<template>
  <van-popup v-model="showAgreement" round custom-style="height: 80%" closeable>
    <div class="agreementBox">
      <div>学霸卡入网服务协议</div>

      <div class="left_text">甲方：（个人签名）</div>

      <div class="left_text">乙方：南京友众力信息技术有限公司</div>

      <div class="left_text">说明：</div>
      <div class="left_text">◆甲方应具有完全的民事行为能力。无民事行为能力或限制民事行为能力的甲方入网时应经过其监护人的同意并签名确认。</div>
      <div class="left_text"> ◆在签署本协议之前，请甲方或其代理人仔细阅读本协议各条款，如有疑问请及时咨询。</div>
      <div class="left_text"> ◆甲方或其代理人在签署本协议后即视为完全理解并同意接受本协议的全部条款。</div>
      <div class="left_text">◆甲方所需的业务、办理手续以及资费标准请参见乙方的相关业务说明。</div>
      <div class="left_text">根据《中华人民共和国合同法》,《中华人民共和国电信条例》及其他有关法律、法规的规定，甲乙双方在平等、自愿、公平、诚实、信用的基础上，就学霸卡通信服务的有关事宜，达成协议如下：
      </div>

      <div class="left_text">一、服务内容和资费标准</div>
      <div class="left_text">1、乙方在现有技术条件下的网络覆盖范围内，为甲方有偿提供通信服务;(暂不提供国际漫游服务)。</div>
      <div class="left_text"> 2、甲方可自主选择乙方提供的承诺服务与业务规定范围内的各项移动通信业务，资费套餐方案有效期为一年，套餐到期后双方如无疑义，有效期逐年自动顺延。

      </div>
      <div class="left_text">
        3、乙方根据政府主管部门批准或备案的资费标准向甲方收取相关费用，包括月租费、通话费、短信、流量包等费用以及甲方申请的其他业务的费用。计费周期为固定时间月，即本月27日到次月26日23:59:59（由于网络设备产生话单及相关处理会有时延，可能发生每月部分话费计入下月话费中收取的情况）。当月1号至26号购买加油包和套餐当月27号0点语音、短信、上网流量（其中包括套餐中的语音、短信、上网流量和用户购买的任意加油包）全部清零，27号至月底购买加油包和套餐下月27号0点语音、短信、上网流量全部清零。
      </div>
      <div class="left_text">4、因为运营商平台等原因造成语音、短信、流量等延时计费，超出套餐部分的费用，由甲方承担。</div>
      <div class="left_text">5、如遇国家统一调整通信费用标准，则按国家统一规定执行。</div>
      <div class="left_text"> 二、乙方的义务</div>
      <div class="left_text">1、乙方为甲方提供的移动通信服务应当达到国家的相关标准。</div>
      <div class="left_text">2、乙方通过APP、微信公众号、网站及短信等方式向甲方公布并提示服务项目、服务时限、服务范围及资费标准等内容。</div>
      <div class="left_text">3、乙方向甲方提供微信号公众号进行业务办理、业务咨询和话费信息查询。</div>
      <div class="left_text">4、乙方有义务采取公布监督电话等形式受理甲方投诉，并在接到投诉之日起15日内答复甲方。</div>
      <div class="left_text">5、乙方对移动电话原始话费数据及信息服务计费原始数据保留期限为5个月，对客户提出异议的话单，应保存至异议解决为止。</div>
      <div class="left_text">6、若甲方对乙方收取的话费存有异议，乙方有责任进行调查、解释，并告知甲方核实处理的结果。</div>
      <div class="left_text">
        7、乙方不得侵害甲方的通信自由和通信秘密，对甲方的客户资料负有保密义务。但根据法律法规规定，乙方应配合公安机关、人民检察院、国家安全机关及依据法律法规有权进行调查的其他部门的工作要求。
      </div>
      <div class="left_text">8、乙方应免费向甲方提供通话所在地（仅限国内）火警119、匪警110、医疗急救120、交通事故报警122等公益性电话主叫服务。</div>
      <div class="left_text">9、在甲方欠费的情况下，如甲方在约定的期限内补齐费用并申请开机的，乙方在收到甲方费用时起24个小时内为甲方恢复移动通信服务。</div>
      <div class="left_text">10、此学霸卡为预付产品，即“先预存话费，后使用”
        的缴费方式。乙方对使用的甲方应进行余额提示，通知方式包括但不限于微信、短信、电话或信函。甲方应保证账户上有充足的款项，如甲方账户满足消费条件的“余额不足”，乙方有权限制或停止向甲方提供服务，且乙方可不再另行通知。
      </div>
      <div class="left_text">11、乙方检修线路、设备搬迁、工程割接、网络及软件升级等可预见的原因可能影响甲方使用的，应于国家规定的时限通知甲方，通知方式包括但不限于微信公众号、短信、媒体公告。</div>
      <div class="left_text">12、甲方向乙方申告移动电话通信障碍（指交换设备或传输线路原因造成通信中断等现象，不包括网络覆盖和终端设备故障），乙方应自接到申告之时起48小时修复或者调通。</div>

      <div class="left_text">13、乙方应在承诺时限内为甲方开通其申请的服务(双方约定超出此时限的除外)，乙方未及时开通的，应减免甲方自申请之日至服务开通期间的该项服务相应的月功能费。</div>
      <div class="left_text">三、甲方的义务</div>
      <div class="left_text">1、 根据运营商要求业务流程及办理要求，
        甲方办理入网手续时，需向乙方提供真实有效的身份证件，代理人代办入网时需同时提供代理人有效身份证件。个人客户的有效证件包括居民身份证（该业务暂不对企业单位客户开放受理）。如甲方入网登记资料发生变更，应及时通知乙方，并应及时通过乙方提供的渠道办理资料变更业务。如运营商实名要求变更，系统将做相应流程调整。
      </div>
      <div class="left_text">2、甲方应按照与乙方约定的时间、方式，及时、足额地向乙方支付移动通信费用。过期未交的款项，自付费日期期满后次日起，甲方应按照每日未交款项的3‰（千分之三）向乙方支付违约金。
      </div>
      <div class="left_text">3、若甲方对乙方收取的移动通信费及代信息服务商收取的信息费存有异议，应在异议话费发生后五个月内向乙方提出(系统产生客户话单当月起后5个月，不含当月)。</div>
      <div class="left_text">
        4、甲方要求终止提供移动通信服务时，应在结清所有当前已完成话单及相关处理的费用后办理退网手续，由于网络设备产生话单及相关处理会有时延，退网时可能会存在部分费用尚未到帐，甲方可在所有话单全部处理后办理话费余额的清退或补收手续。
      </div>
      <div class="left_text">四、特殊情况的责任承担</div>
      <div class="left_text">1、在下列情况下，乙方有权暂停或限制甲方的移动通信服务，由此给甲方造成的损失，乙方不承担责任：</div>
      <div class="left_text">（1）甲方银行帐户被查封、冻结或余额不足等非乙方原因造成乙方结算时划扣不成功的；</div>
      <div class="left_text">（2）甲方预付费使用完毕而未及时补交款项（包括预付费账户余额不足以划扣下一笔预付费用）的；</div>
      <div class="left_text">（3）甲方使用“先使用，后付费”的费用结算方式时，移动电话费用超过可透支额度的；</div>
      <div class="left_text">（4）甲方突然出现超过自己此前三个月平均通信费用5倍以上通信费用的；</div>
      <div class="left_text">（5）甲方发送带有非法内容信息的。</div>
      <div class="left_text">2、 甲方名下的移动电话号码逾期未交清费用，乙方有权拒绝甲方以自己名义提出的其他移动通信业务申请，缴费、话费查询除外。</div>
      <div class="left_text">3、按照公平使用原则，乙方将对甲方的移动数据流量进行封顶限制，甲方购买的移动数据流量达到或超岀流量封顶额度时，乙方可暂停甲方当时的上网服务，续费或再次购买流量套包后自动恢复开通。
      </div>
      <div class="left_text">4、在甲方欠费时，乙方有权按照国家相关规定暂停或限制甲方的移动通信服务，有权以信函、公告、委托第三方等形式追缴欠费。</div>
      <div class="left_text">
        5、甲方入网后即获取客户服务密码，甲方应及时修改并注意妥善保管。服务密码是甲方办理乙方公布的相关移动业务的凭证。凡使用服务密码办理、定制、变更、取消服务与业务的行为均被视为甲方或甲方授权的行为，行为后果及影响由甲方负责。为方便、安全的办理业务，乙方也可根据甲方申请或所办理的业务类别以短信等方式向甲方提供随机服务密码，该密码可作为甲方办理业务临时、辅助的凭证。
      </div>
      <div class="left_text">6、甲方所办理的数据业务下行速率标称值仅为乙方提供的数据业务下行速率最高值，乙方不能保证在任何情况下均能达到标称值，甲方对此表示知悉并认可。</div>
      <div class="left_text">7、因甲方保管不善等原因导致其移动电话被他人非法使用，甲方应及时办理停机手续，并向公安部门报案。乙方应在技术上协助公安部门进行调查，但乙方不承担由此对甲方所造成的不良后果。
      </div>
      <div class="left_text">8、因甲方提供的客户资料不详、不实或变更后未通知乙方并办理客户资料变更手续等原因，使乙方无法将服务提供给甲方，乙方不承担由此对甲方所造成的不良后果。</div>
      <div class="left_text">9、因不可抗力（包括但不限于如地震、山洪、雷电及其他自然灾害、电磁干扰、战争暴乱、政府行为等）而使本协议部分或全部不能履行，双方互不承担违约责任。</div>

      <div class="left_text"> 10、
        一方违约给对方造成损失的，应当依法承担赔偿责任，但任何一方应承担的赔偿损失的责任范围不包括对方未实现的预期利润或利益、商业信誉的损失、数据的丢失、第三方损失以及其他间接损失。
      </div>
      <div class="left_texe">
        11、用乙方提供基于位置的服务时，乙方需要收集和处理甲方的位置信息、行踪轨迹。乙方会使用各种方式进行定位，包括通过IP地址、卫星信号以及能够提供相关信息的其他传感器（比如可能会为乙方提供附近设备、WLAN接入点和基站的信息）。甲方授权乙方及电信运营商及其他卫星定位合作伙伴基于上述服务收集、处理、提供乙方的位置、行踪轨迹等个人信息。乙方会对甲方位置信息进行定位计算和路径计算，帮助甲方获得更加精准的定位和路径服务。甲方可以通过系统授权关闭定位服务或系统权限，停止乙方对甲方位置信息的收集，但甲方可能将无法获得相关服务或功能，或者无法达到相关服务拟达到的效果。
      </div>
      <div class="left_texe">12、在适当位置链接中国联通用户隐私政策：http://www.10010.com/net5/front/include/index_a/privacypolicy.html</div>
      <div class="left_text">五、协议的变更、转让与终止</div>
      <div class="left_text">1、 甲方办理各类业务所签署的表单、乙方以公告等书面形式公开做出的服务承诺均为本协议的补充协议，与本协议冲突部分以补充协议为准，补充协议中未约定部分以本协议为准。</div>
      <div class="left_text">2、
        鉴于移动通信服务的特殊性，双方约定当本协议服务内容、方式及资费等按照政府主管部门、乙方上级公司规定在政策许可的范围内须作变更的，由甲方通过办理业务实现或由乙方进行公告，公告内容构成对本协议的变更，双方不再另行签订变更协议。
      </div>
      <div class="left_text">
        3、乙方承诺资费方案有效期为一年（双方特殊约定的除外）。乙方有权在有效期截止后修改资费方案。如需修改，乙方应在有效期届满前通知甲方，通知方式包括但不限于短信、线上营业厅、APP、微信公众号等公告。如无需修改，则原资费方案顺延一年，顺延次数不限。
      </div>

      <div class="left_text">4、 甲方将协议项下的权利义务转让给第三人（过户）后，由第三人与乙方重新签订移动通信入网服务协议, 本协议自动终止;
        过户前发生的、但过户时尚未结算的费用，乙方将向新客户收取。因甲方私自转让而造成的欠费、停机等后果，由甲方自行承担。
      </div>
      <div class="left_text">5、因技术进步，乙方为提升服务质量对移动电话网络进行整体换代升级而导致移动通信服务无法继续履行的，乙方应至少提前90日告知甲方，并提供合理的解决方案。</div>
      <div class="left_text">6、下列情况下乙方有权解除协议，收回号码，终止提供服务。由此给甲方造成的损失，乙方不承担责任，并有权向甲方追讨欠费：</div>
      <div class="left_text">（1）甲方（包括代理人）提供的有效证件虚假不实；</div>
      <div class="left_text">（2）移动电话被用于违法犯罪活动或不当用途（有损乙方或相关第三方利益）；</div>
      <div class="left_text">（3）乙方收到国家有关部门发文要求停止为甲方提供通信服务；</div>
      <div class="left_text">（4）甲方欠费停机超过90天。</div>

      <div class="left_text">7、在法定终止条件或约定终止条件具备时，本协议终止。乙方继续保留向甲方追缴所欠费用的权利，并有权收回号码重新启用。</div>

      <div class="left_text">六、其他约定</div>

      <div class="left_text">1、信息服务提供商通过乙方的移动网络平台提供的增值电信应用服务，甲方可自愿订购或退订。</div>

      <div class="left_text">2、如甲方通过乙方的通信网络等相关途径或渠道定制、收发与乙方有合作关系的信息服务提供商所提供的各类信息，甲方同意乙方根据信息服务提供商的授权，向甲方代为收取信息费。
      </div>

      <div class="left_text"> 3、甲方使用信息服务提供商提供的增值电信应用服务的资费标准由信息服务提供商公布。若甲方对收取的服务费用有异议，可在乙方协助下与信息服务提供商协商解决。</div>

      <div class="left_text">
        4、本协议项下发生的争议，双方可协商解决，协商不成的，双方可向电信管理部门申诉或向消费者协会等有关部门投诉。双方通过协商不能解决争议的，则乙方同意在甲方入网所在地按甲方选择的仲裁机构或诉讼方式解决。
      </div>

      <div class="left_text">5、本协议自业务受理之日起生效，有效期一年。本协议到期时，如甲乙双方均未提出对套餐资费的修改要求，将继续执行本协议约定的套餐资费。
        （甲方承诺：本人已经充分、完整阅读并理解本协议所述全部条款及条件。如申请或使用乙方提供的业务，即视为您已阅读井同意受本协议的约束。）
      </div>

      <div class="left_text">甲方 ：（签名） 甲方监护人或代理人：（签名）</div>
      <div class="left_text">乙方：南京友众力信息技术有限公司</div>

      <div class="left_text">甲方手机号码：</div>

      <div class="left_text">签署日期： 年 月 日</div>
    </div>
  </van-popup>
</template>
<script>
export default {
  data () {
    return {
      showAgreement: false
    }
  }
}
</script>

<style lang="less">
.agreementBox {
  font-size: 12px;
  padding: 15px;
  width: 6rem;
  height: 10rem;
  .left_text {
    padding: 5px 0;
  }
}
</style>
